Source/SOAP_Request_App/BookitRequest - Copy (2).xml

<?xml version="1.0" encoding="utf-8"?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
  <soap-env:Header>
    <Interface xmlns="http://www.bookit.com/api/Documentation/XML/OTA/4/2011A/" ChannelIdentifierId="BookIt.com XML4" Version="2011A" Interface="SourceSys XML">
      <ComponentInfo Id="04819" User="TiKoob" Pwd="TiKoob" ComponentType="Hotel"/>
    </Interface>
  </soap-env:Header>
  <soap-env:Body>
    <OTA_HotelResNotifRQ xmlns="http://www.opentravel.org/OTA/2003/05" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.opentravel.org/OTA/2003/05 OTA_HotelResNotifRQ.xsd" Version="1.003">
      <HotelReservations>
        <HotelReservation>
          <RoomStays>
            <RoomStay>
              <RoomRates>
                <RoomRate RoomTypeCode="10016" RatePlanCode="BKPROMO1" EffectiveDate="2013-11-28" ExpireDate="2013-11-29">
                  <Rates>
                    <Rate EffectiveDate="2013-11-28" ExpireDate="2013-11-29">
                      <Total AmountBeforeTax="167.2" AmountAfterTax="187.26" CurrencyCode="USD"/>
                    </Rate>
                  </Rates>
                </RoomRate>
              </RoomRates>
              <GuestCounts>
                <GuestCount AgeQualifyingCode="10" Count="2"/>
              </GuestCounts>
              <TimeSpan Start="2013-11-28" End="2013-11-29"/>
              <Total AmountBeforeTax="167.2" AmountAfterTax="187.26" CurrencyCode="USD"/>
              <ResGuestRPHs>
                <ResGuestRPH RPH="1"/>
              </ResGuestRPHs>
              <Guarantee>
                <GuaranteesAccepted>
                  <GuaranteeAccepted>
                    <PaymentCard CardCode="CA" CardNumber="5418221592166869" ExpireDate="1213" SeriesCode="716">
                      <CardHolderName>BookIt.com</CardHolderName>
                    </PaymentCard>
                  </GuaranteeAccepted>
                </GuaranteesAccepted>
              </Guarantee>
              <BasicPropertyInfo ChainCode="" HotelCode="04819"/>
              <Comments>
                <Comment>
                  <Text>LEISURELINK TEST BOOKING BOOKIT</Text>
                </Comment>
              </Comments>
            </RoomStay>
          </RoomStays>
          <ResGuests>
            <ResGuest RPH="1">
              <Profiles>
                <ProfileInfo>
                  <Profile ProfileType="1">
                    <Customer>
                      <PersonName>
                        <GivenName>TraceyTest</GivenName>
                        <Surname>LeisureLinkTest</Surname>
                      </PersonName>
                      <Telephone PhoneNumber="6266964500" PhoneTechType="Voice"/>
                      <Email>tlieu@leisurelink.com</Email>
                    </Customer>
                  </Profile>
                </ProfileInfo>
              </Profiles>
            </ResGuest>
            <ResGuest RPH="1">
              <Profiles>
                <ProfileInfo>
                  <Profile ProfileType="1">
                    <Customer>
                      <PersonName>
                        <GivenName>LeisureLink</GivenName>
                        <Surname>Bookittest</Surname>
                      </PersonName>
                    </Customer>
                  </Profile>
                </ProfileInfo>
              </Profiles>
            </ResGuest>
            <ResGuest RPH="0">
              <Profiles>
                <ProfileInfo>
                  <Profile ProfileType="1">
                    <Customer>
                      <PersonName>
                        <GivenName>Tracey</GivenName>
                        <Surname>Lieu</Surname>
                      </PersonName>
                      <Telephone PhoneNumber="6266795314" PhoneTechType="Voice"/>
                      <Email>tracylieu6785@hotmail.com</Email>
                    </Customer>
                  </Profile>
                </ProfileInfo>
              </Profiles>
            </ResGuest>
          </ResGuests>
          <ResGlobalInfo>
            <HotelReservationIDs>
              <HotelReservationID ResID_Type="14" ResID_Value="27154845" ResID_Source="BookIt.com"/>
            </HotelReservationIDs>
          </ResGlobalInfo>
        </HotelReservation>
      </HotelReservations>
    </OTA_HotelResNotifRQ>
  </soap-env:Body>
</soap-env:Envelope>
