project/tmp/20180726/report_bw-exp_29/cache/1.840000.txt

['<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><OTA_HotelResNotifRQ xmlns="http://www.opentravel.org/OTA/2003/05" EchoToken="REQ01010MOD1" PrimaryLangID="en_US" ResStatus="Modify" Target="Test" TimeStamp="2018-07-26T06:12:21.758Z" TransactionIdentifier="52B3A07ADC0E4B0E867C01627605D2F1" Version="5.000"><HotelReservations><HotelReservation><POS><Source><RequestorID ID="00171010" Type="4"/><BookingChannel Type="7"><CompanyName Code="EXP2"/></BookingChannel></Source></POS><UniqueID ID="CHN01010" Instance="PNR" Type="14"/><UniqueID ID="HTL01010" Instance="CNF" Type="10"/><RoomStays><RoomStay WarningRPH=""><RoomTypes><RoomType BedTypeCode="" NumberOfUnits="1" RoomTypeCode="2220470"/></RoomTypes><RoomRates><RoomRate RatePlanCode="EX1"><Rates><Rate EffectiveDate="2018-05-17" ExpireDate="2018-05-18" RateTimeUnit="Day" UnitMultiplier="1"><Base AmountAfterTax="100.000" AmountBeforeTax="100.000"/></Rate></Rates></RoomRate></RoomRates><GuestCounts><GuestCount AgeQualifyingCode="1" Count="2"/></GuestCounts><TimeSpan End="2018-05-18" Start="2018-05-17"/><Total AmountAfterTax="113.750" AmountBeforeTax="113.750" CurrencyCode="USD"/><BasicPropertyInfo ChainCode="BW" HotelCode="19010"/><ResGuestRPHs>1</ResGuestRPHs><SpecialRequests><SpecialRequest><Text>Expedia RES ID CHN01010 2 King Normal Bed. Quiet Area. Payment When Arrival. </Text></SpecialRequest></SpecialRequests></RoomStay></RoomStays><ResGuests><ResGuest ResGuestRPH="1"><Profiles><ProfileInfo><Profile StatusCode=""><Customer><PersonName><GivenName>Geoge</GivenName><Surname>Meals</Surname></PersonName><Telephone AreaCityCode="123" CountryAccessCode="2" PhoneNumber="88888888" PhoneTechType="VOICE" PhoneUseType="4"/><Address Type="1"><AddressLine>Unknown</AddressLine></Address></Customer></Profile></ProfileInfo></Profiles></ResGuest></ResGuests><ResGlobalInfo><Guarantee GuaranteeCode="GCC"><GuaranteesAccepted><GuaranteeAccepted><PaymentCard CardCode="VI" CardNumber="5111111111111118" ExpireDate="1220"><CardHolderName>Mrs. Shelia Brown</CardHolderName></PaymentCard></GuaranteeAccepted></GuaranteesAccepted></Guarantee></ResGlobalInfo></HotelReservation></HotelReservations></OTA_HotelResNotifRQ></SOAP-ENV:Body></SOAP-ENV:Envelope>']