project/tmp/20180726/report_bw-exp_32/cache/3.030000.txt

['<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><OTA_CancelRQ xmlns="http://www.opentravel.org/OTA/2003/05" CancelType="Cancel" EchoToken="e37c28d5-a6e2-4190-b105-0d64e47bb438" PrimaryLangID="en_US" Target="Test" TimeStamp="2018-07-26T07:14:05.002Z" TransactionIdentifier="F5FA0679B1044A8E8CAB37C7EF7362A8" Version="5.000"><UniqueID ID="BW" Instance="CHN" Type="10"/><UniqueID ID="HTL01031" Instance="CNF" Type="14"/><UniqueID ID="CHN01031" Instance="PNR" Type="14"/></OTA_CancelRQ></SOAP-ENV:Body></SOAP-ENV:Envelope>']